/*1. 你的程序是如何完成排序的：
  标在程序里了，如下
  2.冒泡排序的基本思路是什么：
  比较相邻两数的大，如果前面的比后面的大则交换位置，否则不变，然后比较下一组相邻的两数，再排序，循环往复，直至排序完成
  3.如果要改成从大到小排序，需要修改哪里：
  把20行if (arr[j] > arr[j + 1])中大于号改成小于号就行，即if (arr[j] < arr[j + 1])
	 */

#include<stdio.h>
int main()
{
	int arr[6] = { 8,3,6,2,7,1 };
	//先创建一个数组，告诉程序有哪些数并进行编号
	for (int i = 0;i < 5;i++)
	//进行外层循环,一轮一轮地比较。注：写“i<5”而不是“6”是因为6个数最多5轮就能排完
	{
		for (int j=0; j<6-1-i;j++)
		//这里开始内层循环，从数组开头开始，一对一对地比较相邻的两个数字。
		{
			if (arr[j] > arr[j + 1])
			//判断相邻两个数字的顺序对不对，如果左大于右，则用以下方式交换位置
			{
				int t = arr[j];
				//左边数字放到t里
				arr[j] = arr[j + 1];
				//右边数字放到左边
				arr[j + 1] = t;
				//t中的数字放到右边
			}
		}
	}
	//然后输出结果
	for (int i = 0;i < 6;i++)
	{
		printf("%d\t", arr[i]);
	}
	return 0;
}
